app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "steve"], ["last_name", "kim"], ["created_at", "2021-03-26 20:39:16.153508"], ["updated_at", "2021-03-26 20:39:16.153508"]]
---
  def create
    student = Student.create(params.require(:student).permit(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @student = Student.find_by(id: params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "joohyun"], ["updated_at", "2021-03-26 20:39:37.758487"], ["id", 3]]
---
  def update
    student = Student.find_by(id: params[:id])
    student.update(params.require(:student).permit(:first_name, :last_name))